import streamlit as st

#ส่วนหัวข้อเว็บ (Header)
st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน✨")
st.write("นี่คือเว็บแอปพลิเคชั่นแรกในชีวิตของผม/ดิฉัน เขียนด้วยภาษา Python ค่ะ")

st.divider() # เส้นคั่นแบ่งสัดส่วนให้สวยงาม

#ส่วนข้อมูลส่วนตัว(Profile Into)
st.header("👤ข้อมูลส่วนตัว")
st.write("**ชื่อ-นามสกุล:**นางสาว นันท์ลภัส จำต๊ะ")
st.write("**ชั้น ม.4/13** เลขที่ 32")
st.write("**โรงเรียนยุพ:ยุพราชวิทยาลัย")

#ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็บครั้งแรก"):
   st.success(f"ว้าว! สนุกและง่ายกว่าที่คิดมาก ๆ! 🎉")
      
